In [2]:
import pandas as pd

In [20]:
list1 = ["Nadir Ali", "Mustaqeem", "Hassan"]
s1 = pd.Series(list1, index=[1,2,3])
s1.index.name = "S:No"
s1

S:No
1    Nadir Ali
2    Mustaqeem
3       Hassan
dtype: object

In [50]:
names = pd.DataFrame({
    "Name:": ['Nadir Ali', 'Irshad Ali', 'Farman'],
    "Age:" : [20, 44, 21],
    "City" : ['Sukkur', 'KHI','ISB'],
    "Salary": [10000, 20000, 3000]
                     })
names.index.name = "S:No"

# print(names)
csv = names.to_csv("data.csv", index = False)
names

           Name:  Age:    City  Salary
S:No
0      Nadir Ali    20  Sukkur   10000
1     Irshad Ali    44     KHI   20000
2         Farman    21     ISB    3000

'Nadir ALi'

In [55]:
data = pd.DataFrame( {
 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Ella'],
 'Age': [25, 30, 35, 40, 29],
 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
 'Salary': [70000, 80000, 120000, 110000, 95000]
})
data.index.name = 'S:No'
data.to_csv("employees.csv", index= False)

In [92]:
dt = pd.read_csv('employees.csv')
# functions
# dt.head(2)
# dt.tail(2)
# dt.info()

# dt[["Name", "Age"]]
# dt.iloc[3]

dt [dt['Salary'] > 90000]
dt [dt['Name'] == "Ella"]




# if dt['Salary'] > 90000:
#     print(dt['Salary'])

   Name  Age     City  Salary
4  Ella   29  Phoenix   95000

In [79]:
dt

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston  110000
4     Ella   29      Phoenix   95000